//0. Вывести квадрат числа
 

Console.Write("Введите число - ");
double a = Convert.ToDouble(Console.ReadLine());
a = Math.Pow(a, 2);
Console.Write("Квадрат числа равен - "+a);
